/*
 * 데이터터를 묶어서 사용 : 1개 이름으로 여러 변수에 접근
 * 	배열 : 같은 데이터형 크기를 이용(고정적)
 * 	클래스 : 다른 데이터형을 모아서 관리(가변적)
 * 자바는 클래스로 시작/종료
 * 클래스 구성요소
 * 메소드 영역 : 메모리 자체 관리
 * 	메소드, static 변수
 * 스택 : 프로그래머가 관리. 프로그램 종료시까지 작동
 * 	지역변수, 매개변수({}종료시 메모리 자동 회수)
 * 	1. 변수 : 
 * 		지역변수/매개변수 : 메모리에 저장, 메소드 안에서만 사용 가능
 * 			지역변수 : 요청처리를 위한 변수
 * 			매개변수 : 사용자 요청값이 있는 경우	
 * 			맴버변수 : new를 이용해 따로 생성. 클래스 전체에서 사용
 * 			공유변수 : 컴파일시 한개 메모르 공간 생성
 *  2. 생성자/초기화
 *  3. 메소드
 * 클래스 : 재사용 목적
 * 	1.데이터보호 : 캡슐화/은닉화
 *  2. 재사용 : 상속/포함
 *  3. 유지보수 : 오버라이딩(프로그램에 맞게 변경해 사용)/오버로딩 [다형성]
 */
public class 클래스변수 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}
