/*
 * 연산자
 * 	1. 단항연산자
 * 		1) 증감연산자 : 반복문에서 주로 사용 (++, --[1증가, 감소])
 * 			전치연산자 : 먼저 증가 후 연산 처리, 	후치연산자 : 연산처리 후 증가 처리
 * 		2) 부정연산자 : 조건문에서 주로 사용(! [true/false전환, 반대값으로])
 * 		3) 형변환연산자 : 데이터형 변환(데이터형에 대한 형변환->클래스 형변환(is-a, has-a)
 * 	2. 이항연산자 : 연산대상이 2개인 경우
 * 		1) 산술연산자(+,-,*,/) : 비트연산자(&, |, ^), 쉬프트연산자(<<,>>), 반전연산자(~[양,음수전환]),
 * 		2) 비교연산자 : 왼쪽 기준(==,!=,<,>,<=,>=)
 * 		3) 논리연산자(&&, ||) : and, or
 * 		4) 대입연산자(+=, -=)	
 * 	3. 삼항연산자(if~else를 전환, html과 자바 연결) : 소스를 줄위기 위해 주로 사용
 *
 */
public class 자바연산자_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int a=10;
		System.out.println();
	}

}
