/*
 * 프로그램->변수 연산자 제어문
 * 프로그램 제어
 * 	1. 조건문 : 프로그램에서 조건에 맞는 문장만 실행어 가능
 * 		단일조건문 : if{}						|		부정연산자,비교연산자,논리연산자만 사용 가능	|		오류처리 등		
 * 		선택조건문 : if{} else{}				|		if가 ture일시, false일시 else
 * 		다중조건문 : if{} else if{} else{}		|		경우의 수가 많은 경우						|		애플리케이션->웹
 *  2. 반복문 : 같은 동작을 하는 소스 모아서 처리		|		데이터베이스/파일 읽기, 화면출력 등
 *  	반복횟수가 지정된 경우 : for
 *  		for(초기값; 조건식; 증가식) {반복수행문장}		|		초기값 후 조건식, 반복수행문장, 증가식 루프
 *  	반복횟수를 모르는 경우 : while		//순차적으로 수행
 *  		초기값 while(조건문) {반복수행문장 증가식}		|		초기값 후 조건문, 반복수행문장, 증가식 루프
 *  3. 반복제어문 : 필요에 따라 반복을 종료/특정부분 제어(소속 반복문만 제어)
 *  	break;		|		for/while문 무조건 종료
 *  	continue;	|		for문 증가식, while문 조건식(무한루프, 처음부터 실행)
 *  	system.exit(0)		|		braek대신 사용 가능. 프로그램 완전 종료시 사용
 */
public class 제어문정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
